feat: protocol rid of ascii art pls
